<?xml version="1.0" ?>
<net name="cnn_16_2" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f16" shape="2,3,50,50"/>
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>3</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_/copy_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>3</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Mul_/Transpose/Cast_1984_const" type="Const" version="opset1">
			<data element_type="i64" offset="6" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Mul_/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>50</dim>
					<dim>50</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="CNN/images/Cast_1990_const" type="Const" version="opset1">
			<data element_type="i64" offset="38" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="CNN/images" type="Reshape" version="opset1">
			<data special_zero="False"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>50</dim>
					<dim>50</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>50</dim>
					<dim>50</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="CNN/images/Transpose/Cast_1988_const" type="Const" version="opset1">
			<data element_type="i64" offset="70" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="CNN/images/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>50</dim>
					<dim>50</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>3</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="CNN/conv0/batch_normalization/batchnorm/mul_1565567_const" type="Const" version="opset1">
			<data element_type="f16" offset="102" shape="4,3,3,3" size="216"/>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="CNN/conv0/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>3</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>4</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="CNN/conv0/batch_normalization/batchnorm/sub/add_/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="318" shape="1,4,1,1" size="8"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="CNN/conv0/batch_normalization/batchnorm/add_1" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>4</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="CNN/conv0/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>4</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="CNN/pool0/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
					<dim>50</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>4</dim>
					<dim>25</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="CNN/conv1/batch_normalization/batchnorm/mul_1569571_const" type="Const" version="opset1">
			<data element_type="f16" offset="326" shape="8,4,3,3" size="576"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="CNN/conv1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
					<dim>25</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>4</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>8</dim>
					<dim>25</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="CNN/conv1/batch_normalization/batchnorm/sub/add_/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="902" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="CNN/conv1/batch_normalization/batchnorm/add_1" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>8</dim>
					<dim>25</dim>
					<dim>25</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>8</dim>
					<dim>25</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="CNN/conv1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>8</dim>
					<dim>25</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>8</dim>
					<dim>25</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="CNN/pool1/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>8</dim>
					<dim>25</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>8</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="CNN/conv2/batch_normalization/batchnorm/mul_1573575_const" type="Const" version="opset1">
			<data element_type="f16" offset="918" shape="16,8,3,3" size="2304"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="CNN/conv2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>8</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>16</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="CNN/conv2/batch_normalization/batchnorm/sub/add_/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f16" offset="3222" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="CNN/conv2/batch_normalization/batchnorm/add_1" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>16</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>16</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="CNN/conv2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>16</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>16</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="CNN/pool2/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="2,2" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>16</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>2</dim>
					<dim>16</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="CNN/pool2/MaxPool/Transpose/Cast_1982_const" type="Const" version="opset1">
			<data element_type="i64" offset="6" shape="4" size="32"/>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="CNN/pool2/MaxPool/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>16</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>6</dim>
					<dim>6</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="CNN/features/features/Cast_1986_const" type="Const" version="opset1">
			<data element_type="i64" offset="3254" shape="2" size="16"/>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="CNN/features/features" type="Reshape" version="opset1">
			<data special_zero="False"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>6</dim>
					<dim>6</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>2</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="CNN/features/features/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>576</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="19" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="24" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="1"/>
		<edge from-layer="24" from-port="2" to-layer="25" to-port="0"/>
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="1" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="30" to-port="0"/>
		<edge from-layer="29" from-port="1" to-layer="30" to-port="1"/>
		<edge from-layer="30" from-port="2" to-layer="31" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2020.1.0-61-gd349c3ba4a"/>
		<cli_parameters>
			<blobs_as_inputs value="True"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="False"/>
			<generate_experimental_IR_V10 value="True"/>
			<input value="input"/>
			<input_model value="DIR/frozen_cnn.pb"/>
			<input_model_is_text value="False"/>
			<input_shape value="[2,50,50,3]"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{'input': {'mean': None, 'scale': array([255., 255., 255.])}}"/>
			<mean_values value="()"/>
			<model_name value="cnn_16_2"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="{'input': array([ 2, 50, 50,  3])}"/>
			<progress value="True"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="input[255.0,255.0,255.0]"/>
			<silent value="False"/>
			<stream_output value="True"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, input_checkpoint, input_meta_graph, input_proto, input_symbol, mean_file, mean_file_offsets, nd_prefix_name, output, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
